// ПРИМЕР СМЕНЫ АДРЕСА МОДУЛЯ:                    // * Строки со звёздочкой являются необязательными.
                                                  //
// Джойстик, FLASH-I2C (Trema-модуль):            //   https://iarduino.ru/shop/Expansion-payments/dzhoystik-i2c---flash-trema-modul.html
// Информация о подключении модулей к шине I2C:   //   https://wiki.iarduino.ru/page/i2c_connection/
// Информация о модуле и описание библиотеки:     //   https://wiki.iarduino.ru/page/joystick-i2c/
                                                  //
// Данный скетч демонстрирует не только           //
// возможность смены адреса на указанный в        //
// переменной newAddress, но и обнаружение,       //
// и вывод текущего адреса модуля на шине I2C.    //
                                                  //
// Библиотека <iarduino_I2C_Joystick.h>           //
// предназначена для работы с джойстиками серии   //
// I2C-flash и меняет только их адреса.           //
// Но, в разделе Файл/Примеры/.../findSortDevices //
// находятся примеры смены и сортировки адресов   //
// любых модулей iarduino серии Flash I2C.        //
                                                  //
uint8_t newAddress = 0x09;                        //   Назначаемый модулю адрес (0x07 < адрес < 0x7F).
                                                  //
#include <Wire.h>                                 //   Подключаем библиотеку для работы с аппаратной шиной I2C, до подключения библиотеки iarduino_I2C_Joystick.
#include <iarduino_I2C_Joystick.h>                //   Подключаем библиотеку для работы с джойстиком I2C-flash.
iarduino_I2C_Joystick joy;                        //   Объявляем объект joy для работы с функциями и методами библиотеки iarduino_I2C_Joystick.
                                                  //   Если при объявлении объекта указать адрес, например, joy(0xBB), то пример будет работать с тем модулем, адрес которого был указан.
void setup(){                                     //
    delay(500);                                   // * Ждём завершение переходных процессов связанных с подачей питания.
    Serial.begin(9600);                           //
    while(!Serial){;}                             // * Ждём завершения инициализации шины UART.
    if( joy.begin(&Wire) ){                       //   Инициируем работу с джойстиком, указав ссылку на объект для работы с шиной I2C на которой находится джойстик (Wire, Wire1, Wire2 ...).
        Serial.print("Найден джойстик 0x");       //
        Serial.println( joy.getAddress(), HEX );  //   Выводим текущий адрес модуля.
        if( joy.changeAddress(newAddress) ){      //   Меняем адрес модуля на newAddress.
            Serial.print("Адрес изменён на 0x");  //
            Serial.println(joy.getAddress(),HEX );//   Выводим текущий адрес модуля.
        }else{                                    //
            Serial.println("Адрес не изменён!");  //
        }                                         //
    }else{                                        //
        Serial.println("Джойстик не найден!");    //
    }                                             //
}                                                 //
                                                  //
void loop(){                                      //
}                                                 //
