// ДАННЫЙ ПРИМЕР ВЫВОДИТ СЫРЫЕ ЗНАЧЕНИЯ АЦП:      // * Строки со звёздочкой являются необязательными.
                                                  //
// Джойстик, FLASH-I2C (Trema-модуль):            //   https://iarduino.ru/shop/Expansion-payments/dzhoystik-i2c---flash-trema-modul.html
// Информация о подключении модулей к шине I2C:   //   https://wiki.iarduino.ru/page/i2c_connection/
// Информация о модуле и описание библиотеки:     //   https://wiki.iarduino.ru/page/joystick-i2c/
                                                  //
#include <Wire.h>                                 //   Подключаем библиотеку для работы с аппаратной шиной I2C, до подключения библиотеки iarduino_I2C_Joystick.
#include <iarduino_I2C_Joystick.h>                //   Подключаем библиотеку для работы с джойстиком I2C-flash.
iarduino_I2C_Joystick joy(0x09);                  //   Объявляем объект joy для работы с функциями и методами библиотеки iarduino_I2C_Joystick, указывая адрес модуля на шине I2C.
                                                  //   Если объявить объект без указания адреса (iarduino_I2C_Joystick joy;), то адрес будет найден автоматически.
void setup(){                                     //
    delay(500);                                   // * Ждём завершение переходных процессов связанных с подачей питания.
    Serial.begin(9600);                           //
    while(!Serial){;}                             // * Ждём завершения инициализации шины UART.
    joy.begin(&Wire); // &Wire1, &Wire2 ...       //   Инициируем работу с джойстиком, указав ссылку на объект для работы с шиной I2C на которой находится джойстик (по умолчанию &Wire).
}                                                 //
                                                  //
void loop(){                                      //
//  Получаем и выводим АЦП по отдельности:        //
    Serial.print( "X=" );                         //
    Serial.print( joy.getADC_X() );               //   Выводим показания АЦП снятые с потенциометра установленного на оси X джойстика, значение от 0 до 4095.
    Serial.print( ", Y=" );                       //
    Serial.print( joy.getADC_Y() );               //   Выводим показания АЦП снятые с потенциометра установленного на оси Y джойстика, значение от 0 до 4095.
//  Получаем сразу оба значения АЦП джойстика:    //
    int x,y;                                      //   Объявляем переменные для получения АЦП снятых с потенциометров джойстика.
    joy.getADC(x,y);                              //   Получаем значения АЦП в указанные переменные.
    Serial.print( ", X:Y=" );                     //
    Serial.print( x );                            //   Выводим показания АЦП снятые с потенциометра установленного на оси X джойстика, значение от 0 до 4095.
    Serial.print( ":" );                          //
    Serial.print( y );                            //   Выводим показания АЦП снятые с потенциометра установленного на оси Y джойстика, значение от 0 до 4095.
    Serial.println( "." );                        //
}                                                 //